<?php
return [
    'api' => [
        'token' => 'https://ipg.polcard.ir/web/getToken/'
    ],
    'errors' => [
        'token' => [
            1 => 'فرمت کلید صحیح نیست',
            2 => 'مبلغ وارد شده صحیح نیست',
            3 => 'داده اضافی معتبر نیست',
            4 => 'شناسه پرداخت معتبر نیست',
            5 => 'آدرس برگشت صحیح نیست',
            6 => 'آدرس برگشت معتبر نیست',
            7 => 'کلید معتبر نیست',
            9 => 'نتیجه تراکنش از سمت شاپرک',
            10=> 'داده ورودی معتبر نیست',
            11=> ' کد ملی معتبر نیست',
            12=> 'تلفن همراه معتبر نیست',
            13=> 'داده اضافی بیش از حد مجاز است',
            14=> 'زبان نمایش درگاه معتبر نیست',
            99=> 'تا اطالع ثانوی امکان پرداخت مقدور نمی باشد',
        ],
    ],
];


/*
key
price
payLoad
buyID
callBack
language
nationalCode
mobile
additional
*/
